In [5]:
%pylab inline
import pandas
import seaborn

Populating the interactive namespace from numpy and matplotlib

# Load CSV file into memory

In [6]:
data = pandas.read_csv("uber-raw-data-apr14.csv")

In [7]:
data.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
Date/Time    564516 non-null object
Lat          564516 non-null float64
Lon          564516 non-null float64
Base         564516 non-null object
dtypes: float64(2), object(2)
memory usage: 17.2+ MB

##### Since the info shows us that date/time column is a string, we need to extract relevant substrings and convert them into numbers and further into datetime objects.

In [13]:
#dt = '4/30/2014 23:22:00'
#d,t = dt.split()
#d
#m,d,y = d.split('/')

'4/30/2014'

#### A better way to convert is to use pandas.to_datetime function and use the inbuilt functions further.

In [18]:
dt

'4/30/2014 23:22:00'

In [20]:
dt = pandas.to_datetime(dt)
type(dt)

pandas._libs.tslibs.timestamps.Timestamp

In [21]:
dt

Timestamp('2014-04-30 23:22:00')

In [23]:
dt.month

4

In [24]:
dt.week

18

In [25]:
dt.year

2014

### Convert datetime and add some useful columns

In [9]:
data['Date/Time'] = data['Date/Time'].map(pandas.to_datetime)

In [10]:
data.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
Date/Time    564516 non-null datetime64[ns]
Lat          564516 non-null float64
Lon          564516 non-null float64
Base         564516 non-null object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 17.2+ MB

In [23]:
def get_day(dt):
    return dt.day
    
data['day_of_month'] = data['Date/Time'].map(get_day)

In [32]:
#dt = data['Date/Time'][0]

In [33]:
#dt.day

1

In [41]:
data

                 Date/Time      Lat      Lon    Base  day_of_month
0      2014-04-01 00:11:00  40.7690 -73.9549  B02512             1
1      2014-04-01 00:17:00  40.7267 -74.0345  B02512             1
2      2014-04-01 00:21:00  40.7316 -73.9873  B02512             1
3      2014-04-01 00:28:00  40.7588 -73.9776  B02512             1
4      2014-04-01 00:33:00  40.7594 -73.9722  B02512             1
...                    ...      ...      ...     ...           ...
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764            30
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764            30
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764            30
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764            30
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764            30

[564516 rows x 5 columns]

In [12]:
def get_weekday(dt):
    return dt.weekday()

data['weekday'] = data['Date/Time'].map(get_weekday) 

def get_hour(dt):
    return dt.hour

data['hour'] = data['Date/Time'].map(get_hour)

In [13]:
data.head()

            Date/Time      Lat      Lon    Base  weekday  hour
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512        1     0
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512        1     0
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512        1     0
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512        1     0
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512        1     0

In [14]:
data.tail()

                 Date/Time      Lat      Lon    Base  weekday  hour
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764        2    23
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764        2    23
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764        2    23
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764        2    23
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764        2    23

# Analysis

### Analyse Day of Month

In [24]:
data.head()

            Date/Time      Lat      Lon    Base  weekday  hour  day_of_month
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512        1     0             1
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512        1     0             1
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512        1     0             1
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512        1     0             1
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512        1     0             1

In [ ]:
hist(data.data)